controllers/GmiController.php

    public function actionIndex()
    {
        $id = Yii::$app->request->get('id');

        $products = GmiProducts::find()->orderBy(['id' => SORT_DESC])->limit(10)->all();
        $sort = new Sort([
            'attributes' => [
                'updated_at',
                'price',
            ],
            'defaultOrder' => ['updated_at' => SORT_DESC]
        ]);
        $query = GmiProducts::find()->orderBy($sort->orders);
        $pages = new Pagination(['totalCount' => $query->count(), 'pageSize' => 20, 'forcePageParam' => false, 'pageSizeParam' => false]);
        $products = $query->offset($pages->offset)->limit($pages->limit)->all();
        $manufactures = GmiProducts::find()->select('article')->orderBy(['article' => SORT_DESC])->groupBy(['article'])->all();
---
SELECT * FROM `gmi_products` ORDER BY `id` DESC LIMIT 10
SELECT * FROM `gmi_products` ORDER BY `updated_at` DESC LIMIT 500
SELECT COUNT(*) FROM `gmi_products`
SELECT `article` FROM `gmi_products` GROUP BY `article` ORDER BY `article` DESC