controllers/ShopController.php

    public function actionCategory($seller)
    {
        $seller = Yii::$app->request->get('seller');
        $shop = Shops::findOne(['short' => $seller]);
        $sort = new Sort([
            'attributes' => [
                'updated_at',
                'price',
                'instock',
            ],
            'defaultOrder' => ['updated_at' => SORT_DESC]
        ]);
        $products = Products::find()->where(['seller' => $seller])->indexBy('id')->orderBy(['updated_at' => SORT_DESC])->all();
        $query = Products::find()->where(['seller' => $seller])->indexBy('id')->orderBy($sort->orders);
        $pages = new Pagination(['totalCount' => $query->count(), 'pageSize' => 10, 'forcePageParam' => false, 'pageSizeParam' => false]);
        $products = $query->offset($pages->offset)->limit($pages->limit)->all();
        $manufactures = Products::find()->where(['seller' => $seller])->select('article')->orderBy(['article' => SORT_DESC])->groupBy(['article'])->all();
---
SELECT * FROM `shops` WHERE `short`='Eic'
SELECT * FROM `products` WHERE `seller`='Eic' ORDER BY `updated_at` DESC
SELECT COUNT(*) FROM `products` WHERE `seller`='Eic'
SELECT * FROM `products` WHERE `seller`='Eic' ORDER BY `updated_at` DESC LIMIT 200 OFFSET 1600
SELECT `article` FROM `products` WHERE `seller`='Eic' GROUP BY `article` ORDER BY `article` DESC