controllers/SiteController.php

    public function actionIndex()
    {
        $id = Yii::$app->request->get('id');
        $products = Setting::findOne(['name' => 'products']);
        $today = Setting::findOne(['name' => 'today']);
        $users = User::find()->all();
        $out_stock = Setting::findOne(['name' => 'out_stock']);
        $products_alex = AlexmeatProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_baltic = BalticProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_eic = EicProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_euphoria = EuphoriaProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_gmi = GmiProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_grantefoods = GrantefoodsProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_lea = LeaProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_leader = LeaderProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_mamta = MamtaProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_megafood = MegafoodProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_natars = MegafoodProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_psv = PsvProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_redoctober = RedoctoberProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_royal = RoyalProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_sakhalin = SakhalinProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_stradiva = StradivaProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_tamani = TamaniProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_three = ThreeProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_zakuson = ZakusonProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
        $products_zenith = ZenithProducts::find()->orderBy(['updated_at' => SORT_DESC])->limit(5)->all();
---
SELECT * FROM `setting` WHERE `name`='products'
SELECT * FROM `setting` WHERE `name`='today'
SELECT * FROM `user`
SELECT * FROM `setting` WHERE `name`='out_stock'
SELECT * FROM `alexmeat_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `baltic_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `eic_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `euphoria_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `gmi_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `grantefoods_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `lea_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `leader_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `mamta_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `megafood_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `psv_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `redoctober_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `royal_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `sakhalin_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `stradiva_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `tamani_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `three_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `zakuson_products` ORDER BY `updated_at` DESC LIMIT 5
SELECT * FROM `zenith_products` ORDER BY `updated_at` DESC LIMIT 5