controllers/UpdatesController.php

SELECT * FROM `gmi_products` WHERE updated_at >= DATE_SUB(CURRENT_DATE, INTERVAL 2 DAY) ORDER BY `updated_at` DESC LIMIT 2800
---
    public function actionGmi($seller = null)
    {
        $id = Yii::$app->request->get('id');
        $seller = Yii::$app->request->get('seller');
        ini_set('max_execution_time', 900);
        $products = Products::getDb()->cache(function (){
            return Products::find()->where(['seller' => 'Gmi'])->indexby('sku')->orderBy(['updated_at' => SORT_DESC])->andWhere(('updated_at >= DATE_SUB(CURRENT_DATE, INTERVAL 2 DAY)'))->limit(2800)->all();
        }, 3600);