views/gmi/index.php

                        <?php if (!empty($products)) : ?>
                            <tbody>
                            <?php foreach ($products as $product) : ?>
                                <?php $last_update = \app\models\GmiUpdates::find()->where(['sku_product' => $product->sku])->andWhere(['!=', 'price', $product->price])->andWhere(('update_at >= DATE_SUB(CURRENT_DATE, INTERVAL 7 DAY)'))->orderBy(['update_at' => SORT_DESC])->one(); ?>
---
SELECT * FROM `gmi_updates` WHERE (`sku_product`='244843') AND (`price` != '53.80') AND (update_at >= DATE_SUB(CURRENT_DATE, INTERVAL 7 DAY)) ORDER BY `update_at` DESC

                                </tr>

                                <?php if (!empty($last_update)) : ?>
                                    <?php $updates = \app\models\GmiUpdates::find()->select(['price', 'update_at', 'sku_product'])->where(['sku_product' => $product->sku])->orderBy(['update_at' => SORT_ASC])->all(); ?>
---
SELECT `price`, `update_at`, `sku_product` FROM `gmi_updates` WHERE `sku_product`='209189' ORDER BY `update_at`